src/InformationRegisters/ЗадачиРелиза/ЗадачиРелиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиРелиза</name>
  <resources>
    <name>Принял</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Принята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НетЗадачиВГит</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НетЗадачиВБитрикс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>DocumentRef.Релиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Релиз/Релиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Релиз</name>
  <registerRecords>InformationRegister.Релизы</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРелиза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolsWorld</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Aelita</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКонфигурация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРазработки</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияОбъектаРазработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Слияния</name>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Версии</name>
    <attributes>
      <name>ОбъектРазработки</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКоммита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗадачиРелиза</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Постановщик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЗадачиРелиза/Forms/ФормаСписка/Module.bsl
// @strict-types


&НаСервере
Процедура ПринятьНаСервере()

	Изменения = Новый Структура;
	Изменения.Вставить("Принята", Истина);
	Изменения.Вставить("Принял", Пользователи.ТекущийПользователь());
	
	ИзменитьДанныеСтроки(Изменения);
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	ПринятьНаСервере();
	УстановитьОтображение();
КонецПроцедуры

&НаСервере
Процедура РелизОтборПриИзмененииНаСервере()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Релиз", Релиз,
		ВидСравненияКомпоновкиДанных.Равно,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РелизОтборПриИзменении(Элемент)
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора((Список, "Релиз", Релиз, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Релиз", Релиз,
		ВидСравненияКомпоновкиДанных.Равно,, Истина);

	//РелизОтборПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("УстановитьОтображение", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображение() Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КомандаПринять.Доступность = Не ТекущиеДанные.Принята;
	Элементы.СнятьОтметку.Доступность = ТекущиеДанные.Принята;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	
	Релиз = Документы.Релиз.ПоследнийДокумент(НастройкиПользователя.Проект);
	РелизОтборПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	СнятьОтметкуНаСервере();
	УстановитьОтображение();
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкуНаСервере()

	Изменения = Новый Структура;
	Изменения.Вставить("Принята", Ложь);
	Изменения.Вставить("Принял", Неопределено);
	
	ИзменитьДанныеСтроки(Изменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтображение();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментарийНаСервере(Комментарий)

	Если Комментарий = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Изменения = Новый Структура;
	Изменения.Вставить("Комментарий", Комментарий);
	
	ИзменитьДанныеСтроки(Изменения);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДанныеСтроки(Изменения)
	
	Перем Запись;
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЗадачиРелиза.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрока, "Релиз, Задача, Постановщик, Ответственный");
	Запись.Прочитать();
	ЗаполнитьЗначенияСвойств(Запись, Изменения);
	Запись.Записать();
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
АСИНХ Процедура ДобавитьКомментарий(Команда)

	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Комментарий = ТекДанные.Комментарий;
	Обещание = ВвестиСтрокуАсинх(Комментарий, НСтр("ru='Введите комментарий'"), , Истина);
	Результат = Ждать Обещание;
	ДобавитьКомментарийНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.СсылкаBitrix) Тогда 
		ПерейтиПоНавигационнойСсылке(ТекДанные.СсылкаBitrix);
	КонецЕсли;
	
КонецПроцедуры
